[
  {
    "title": "Chocolate Chip Cookies",
    "description": "The classic chocolate chip cookie recipe that everyone loves!",
    "ingredients": "1 cup unsalted butter, softened; 1 cup white sugar; 1 cup brown sugar; 2 eggs; 2 teaspoons vanilla extract; 3 cups all-purpose flour; 1 teaspoon baking soda; 2 teaspoons hot water; 1/2 teaspoon salt; 2 cups semisweet chocolate chips",
   "directions": "1 Preheat oven to 350 degrees F (175 degrees C). 2. Cream together the butter, white sugar, and brown sugar until smooth. Beat in the eggs one at a time, then stir in the vanilla. Dissolve baking soda in hot water. Add to batter along with salt. Stir in flour and chocolate chips. Drop by large spoonfuls onto ungreased pans. 3. Bake for about 10 minutes in the preheated oven, or until edges are nicely browned."
  },
  {
    "title": "Spaghetti Bolognese",
    "description": "A classic Italian dish that's hearty and delicious!",
    "ingredients": "1 pound spaghetti; 1 pound ground beef; 1/2 onion, chopped; 2 cloves garlic, minced; 1 (28 ounce) can crushed tomatoes; 2 teaspoons dried basil; 1 teaspoon salt; 1/4 teaspoon black pepper; 1/4 cup grated Parmesan cheese",
    "directions": "1. Cook spaghetti according to package directions. Drain. 2. Meanwhile, in a large skillet over medium heat, cook ground beef until browned. Add onion and garlic; cook until onion is tender. Drain fat. 3. Stir in crushed tomatoes, basil, salt, and pepper. Bring to a boil. Reduce heat; simmer for 10 minutes. 4. Serve sauce over spaghetti. Top with Parmesan cheese."
  },
  {
    "title": "Chicken Parmesan",
    "description": "A delicious and easy Italian-inspired dish!",
    "ingredients": "4 boneless, skinless chicken breasts; 1/2 cup Italian-seasoned breadcrumbs; 1/4 cup grated Parmesan cheese; 1 egg, beaten; 1/2 cup all-purpose flour; 1/4 teaspoon salt; 1/4 teaspoon black pepper; 1/4 cup vegetable oil; 1 cup tomato sauce; 1/2 cup shredded mozzarella cheese",
    "directions": "1. Preheat oven to 375 degrees F (190 degrees C). 2. Place breadcrumbs and Parmesan cheese in a shallow dish. Beat egg in another shallow dish. Place flour in a third shallow dish. Season chicken with salt and pepper. 3. Dredge chicken in flour, then dip in egg, and coat in breadcrumb mixture. 4. In a large skillet, heat vegetable oil over medium-high heat. Add chicken and cook until golden brown, about 3 minutes per side. 5. Place chicken in a baking dish. Top with tomato sauce and mozzarella cheese. 6. Bake in preheated oven for 25 minutes, or until chicken is cooked through and cheese is melted and bubbly."
  }
]

